dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l49x_pinmux.h
	((gpio == PC03) && (func == LCD_VLCD_FUNC            )) ? 11 : \
	((gpio == PC03) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PC03) && (func == LPTIM2_ETR_FUNC          )) ? 14 : \
	((gpio == PC03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC04) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PC04) && (func == QUADSPI_BK2_IO3_FUNC     )) ? 10 : \
	((gpio == PC04) && (func == LCD_SEG22_FUNC           )) ? 11 : \
	((gpio == PC04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC05) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PC05) && (func == LCD_SEG23_FUNC           )) ? 11 : \
	((gpio == PC05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PC06) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PC06) && (func == DFSDM1_CKIN3_FUNC        )) ?  6 : \
	((gpio == PC06) && (func == TSC_G4_IO1_FUNC          )) ?  9 : \
	((gpio == PC06) && (func == DCMI_D0_FUNC             )) ? 10 : \
	((gpio == PC06) && (func == LCD_SEG24_FUNC           )) ? 11 : \
	((gpio == PC06) && (func == SDMMC1_D6_FUNC           )) ? 12 : \
	((gpio == PC06) && (func == SAI2_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PC06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PC07) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PC07) && (func == DFSDM1_DATIN3_FUNC       )) ?  6 : \
	((gpio == PC07) && (func == TSC_G4_IO2_FUNC          )) ?  9 : \
	((gpio == PC07) && (func == DCMI_D1_FUNC             )) ? 10 : \
	((gpio == PC07) && (func == LCD_SEG25_FUNC           )) ? 11 : \
	((gpio == PC07) && (func == SDMMC1_D7_FUNC           )) ? 12 : \
	((gpio == PC07) && (func == SAI2_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PC07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC08) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PC08) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PC08) && (func == TSC_G4_IO3_FUNC          )) ?  9 : \
	((gpio == PC08) && (func == DCMI_D2_FUNC             )) ? 10 : \
	((gpio == PC08) && (func == LCD_SEG26_FUNC           )) ? 11 : \
	((gpio == PC08) && (func == SDMMC1_D0_FUNC           )) ? 12 : \
	((gpio == PC08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC09) && (func == TIM8_BKIN2_FUNC          )) ?  1 : \
	((gpio == PC09) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PC09) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PC09) && (func == DCMI_D3_FUNC             )) ?  4 : \
	((gpio == PC09) && (func == I2C3_SDA_FUNC            )) ?  6 : \
	((gpio == PC09) && (func == TSC_G4_IO4_FUNC          )) ?  9 : \
	((gpio == PC09) && (func == USB_OTG_FS_NOE_FUNC      )) ? 10 : \
	((gpio == PC09) && (func == LCD_SEG27_FUNC           )) ? 11 : \
	((gpio == PC09) && (func == SDMMC1_D1_FUNC           )) ? 12 : \
	((gpio == PC09) && (func == SAI2_EXTCLK_FUNC         )) ? 13 : \
	((gpio == PC09) && (func == TIM8_BKIN2_COMP1_FUNC    )) ? 14 : \
	((gpio == PC09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC10) && (func == SYS_TRACED1_FUNC         )) ?  0 : \
	((gpio == PC10) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PC10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PC10) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PC10) && (func == TSC_G3_IO2_FUNC          )) ?  9 : \
	((gpio == PC10) && (func == DCMI_D8_FUNC             )) ? 10 : \
	((gpio == PC10) && (func == LCD_COM4_FUNC            )) ? 11 : \
	((gpio == PC10) && (func == LCD_SEG28_FUNC           )) ? 11 : \
	((gpio == PC10) && (func == LCD_SEG40_FUNC           )) ? 11 : \
	((gpio == PC10) && (func == SDMMC1_D2_FUNC           )) ? 12 : \
	((gpio == PC10) && (func == SAI2_SCK_B_FUNC          )) ? 13 : \
	((gpio == PC10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC11) && (func == QUADSPI_BK2_NCS_FUNC     )) ?  5 : \
	((gpio == PC11) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PC11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PC11) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PC11) && (func == TSC_G3_IO3_FUNC          )) ?  9 : \
	((gpio == PC11) && (func == DCMI_D4_FUNC             )) ? 10 : \
	((gpio == PC11) && (func == LCD_COM5_FUNC            )) ? 11 : \
	((gpio == PC11) && (func == LCD_SEG29_FUNC           )) ? 11 : \
	((gpio == PC11) && (func == LCD_SEG41_FUNC           )) ? 11 : \
	((gpio == PC11) && (func == SDMMC1_D3_FUNC           )) ? 12 : \
	((gpio == PC11) && (func == SAI2_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PC11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC12) && (func == SYS_TRACED3_FUNC         )) ?  0 : \
	((gpio == PC12) && (func == SPI3_MOSI_FUNC           )) ?  6 : \
	((gpio == PC12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PC12) && (func == UART5_TX_FUNC            )) ?  8 : \
	((gpio == PC12) && (func == TSC_G3_IO4_FUNC          )) ?  9 : \
	((gpio == PC12) && (func == DCMI_D9_FUNC             )) ? 10 : \
	((gpio == PC12) && (func == LCD_COM6_FUNC            )) ? 11 : \
	((gpio == PC12) && (func == LCD_SEG30_FUNC           )) ? 11 : \
	((gpio == PC12) && (func == LCD_SEG42_FUNC           )) ? 11 : \
	((gpio == PC12) && (func == SDMMC1_CK_FUNC           )) ? 12 : \
	((gpio == PC12) && (func == SAI2_SD_B_FUNC           )) ? 13 : \
	((gpio == PC12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PD00) && (func == DFSDM1_DATIN7_FUNC       )) ?  6 : \
	((gpio == PD00) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PD00) && (func == FMC_D2_FUNC              )) ? 12 : \
	((gpio == PD00) && (func == FMC_DA2_FUNC             )) ? 12 : \
	((gpio == PD00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PD01) && (func == DFSDM1_CKIN7_FUNC        )) ?  6 : \
	((gpio == PD01) && (func == CAN1_TX_FUNC             )) ?  9 : \
	((gpio == PD01) && (func == FMC_D3_FUNC              )) ? 12 : \
	((gpio == PD01) && (func == FMC_DA3_FUNC             )) ? 12 : \
	((gpio == PD01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD02) && (func == SYS_TRACED2_FUNC         )) ?  0 : \
	((gpio == PD02) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PD02) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PD02) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PD02) && (func == UART5_RX_FUNC            )) ?  8 : \
	((gpio == PD02) && (func == TSC_SYNC_FUNC            )) ?  9 : \
	((gpio == PD02) && (func == DCMI_D11_FUNC            )) ? 10 : \
	((gpio == PD02) && (func == LCD_COM7_FUNC            )) ? 11 : \
	((gpio == PD02) && (func == LCD_SEG31_FUNC           )) ? 11 : \
	((gpio == PD02) && (func == LCD_SEG43_FUNC           )) ? 11 : \
	((gpio == PD02) && (func == SDMMC1_CMD_FUNC          )) ? 12 : \
	((gpio == PD02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD03) && (func == SPI2_SCK_FUNC            )) ?  3 : \
	((gpio == PD03) && (func == DCMI_D5_FUNC             )) ?  4 : \
	((gpio == PD03) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PD03) && (func == DFSDM1_DATIN0_FUNC       )) ?  6 : \
	((gpio == PD03) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PD03) && (func == QUADSPI_BK2_NCS_FUNC     )) ? 10 : \
	((gpio == PD03) && (func == FMC_CLK_FUNC             )) ? 12 : \
	((gpio == PD03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD04) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PD04) && (func == DFSDM1_CKIN0_FUNC        )) ?  6 : \
	((gpio == PD04) && (func == USART2_DE_FUNC           )) ?  7 : \
	((gpio == PD04) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PD04) && (func == QUADSPI_BK2_IO0_FUNC     )) ? 10 : \
	((gpio == PD04) && (func == FMC_NOE_FUNC             )) ? 12 : \
	((gpio == PD04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD05) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PD05) && (func == QUADSPI_BK2_IO1_FUNC     )) ? 10 : \
	((gpio == PD05) && (func == FMC_NWE_FUNC             )) ? 12 : \
	((gpio == PD05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD06) && (func == DCMI_D10_FUNC            )) ?  4 : \
	((gpio == PD06) && (func == QUADSPI_BK2_IO1_FUNC     )) ?  5 : \
	((gpio == PD06) && (func == DFSDM1_DATIN1_FUNC       )) ?  6 : \
	((gpio == PD06) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PD06) && (func == QUADSPI_BK2_IO2_FUNC     )) ? 10 : \
	((gpio == PD06) && (func == FMC_NWAIT_FUNC           )) ? 12 : \
	((gpio == PD06) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PD06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD07) && (func == DFSDM1_CKIN1_FUNC        )) ?  6 : \
	((gpio == PD07) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PD07) && (func == QUADSPI_BK2_IO3_FUNC     )) ? 10 : \
	((gpio == PD07) && (func == FMC_NE1_FUNC             )) ? 12 : \
	((gpio == PD07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD08) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PD08) && (func == DCMI_HSYNC_FUNC          )) ? 10 : \
	((gpio == PD08) && (func == LCD_SEG28_FUNC           )) ? 11 : \
	((gpio == PD08) && (func == FMC_D13_FUNC             )) ? 12 : \
	((gpio == PD08) && (func == FMC_DA13_FUNC            )) ? 12 : \
	((gpio == PD08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD09) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PD09) && (func == DCMI_PIXCLK_FUNC         )) ? 10 : \
	((gpio == PD09) && (func == LCD_SEG29_FUNC           )) ? 11 : \
	((gpio == PD09) && (func == FMC_D14_FUNC             )) ? 12 : \
	((gpio == PD09) && (func == FMC_DA14_FUNC            )) ? 12 : \
	((gpio == PD09) && (func == SAI2_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PD09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD10) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PD10) && (func == TSC_G6_IO1_FUNC          )) ?  9 : \
	((gpio == PD10) && (func == LCD_SEG30_FUNC           )) ? 11 : \
	((gpio == PD10) && (func == FMC_D15_FUNC             )) ? 12 : \
	((gpio == PD10) && (func == FMC_DA15_FUNC            )) ? 12 : \
	((gpio == PD10) && (func == SAI2_SCK_A_FUNC          )) ? 13 : \
	((gpio == PD10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD11) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PD11) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PD11) && (func == TSC_G6_IO2_FUNC          )) ?  9 : \
	((gpio == PD11) && (func == LCD_SEG31_FUNC           )) ? 11 : \
	((gpio == PD11) && (func == FMC_A16_FUNC             )) ? 12 : \
	((gpio == PD11) && (func == SAI2_SD_A_FUNC           )) ? 13 : \
	((gpio == PD11) && (func == LPTIM2_ETR_FUNC          )) ? 14 : \
	((gpio == PD11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD12) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PD12) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PD12) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PD12) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PD12) && (func == TSC_G6_IO3_FUNC          )) ?  9 : \
	((gpio == PD12) && (func == LCD_SEG32_FUNC           )) ? 11 : \
	((gpio == PD12) && (func == FMC_A17_FUNC             )) ? 12 : \
	((gpio == PD12) && (func == SAI2_FS_A_FUNC           )) ? 13 : \
	((gpio == PD12) && (func == LPTIM2_IN1_FUNC          )) ? 14 : \
	((gpio == PD12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD13) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PD13) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PD13) && (func == TSC_G6_IO4_FUNC          )) ?  9 : \
	((gpio == PD13) && (func == LCD_SEG33_FUNC           )) ? 11 : \
	((gpio == PD13) && (func == FMC_A18_FUNC             )) ? 12 : \
	((gpio == PD13) && (func == LPTIM2_OUT_FUNC          )) ? 14 : \
	((gpio == PD13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD14) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PD14) && (func == LCD_SEG34_FUNC           )) ? 11 : \
	((gpio == PD14) && (func == FMC_D0_FUNC              )) ? 12 : \
	((gpio == PD14) && (func == FMC_DA0_FUNC             )) ? 12 : \
	((gpio == PD14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD15) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PD15) && (func == LCD_SEG35_FUNC           )) ? 11 : \
	((gpio == PD15) && (func == FMC_D1_FUNC              )) ? 12 : \
	((gpio == PD15) && (func == FMC_DA1_FUNC             )) ? 12 : \
	((gpio == PD15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE00) && (func == TIM4_ETR_FUNC            )) ?  2 : \
	((gpio == PE00) && (func == DCMI_D2_FUNC             )) ? 10 : \
	((gpio == PE00) && (func == LCD_SEG36_FUNC           )) ? 11 : \
	((gpio == PE00) && (func == FMC_NBL0_FUNC            )) ? 12 : \
	((gpio == PE00) && (func == TIM16_CH1_FUNC           )) ? 14 : \
	((gpio == PE00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE01) && (func == DCMI_D3_FUNC             )) ? 10 : \
	((gpio == PE01) && (func == LCD_SEG37_FUNC           )) ? 11 : \
	((gpio == PE01) && (func == FMC_NBL1_FUNC            )) ? 12 : \
	((gpio == PE01) && (func == TIM17_CH1_FUNC           )) ? 14 : \
	((gpio == PE01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE02) && (func == SYS_TRACECLK_FUNC        )) ?  0 : \
	((gpio == PE02) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PE02) && (func == TSC_G7_IO1_FUNC          )) ?  9 : \
	((gpio == PE02) && (func == LCD_SEG38_FUNC           )) ? 11 : \
	((gpio == PE02) && (func == FMC_A23_FUNC             )) ? 12 : \
	((gpio == PE02) && (func == SAI1_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PE02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE03) && (func == SYS_TRACED0_FUNC         )) ?  0 : \
	((gpio == PE03) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PE03) && (func == TSC_G7_IO2_FUNC          )) ?  9 : \
	((gpio == PE03) && (func == LCD_SEG39_FUNC           )) ? 11 : \
	((gpio == PE03) && (func == FMC_A19_FUNC             )) ? 12 : \
	((gpio == PE03) && (func == SAI1_SD_B_FUNC           )) ? 13 : \
	((gpio == PE03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE04) && (func == SYS_TRACED1_FUNC         )) ?  0 : \
	((gpio == PE04) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PE04) && (func == DFSDM1_DATIN3_FUNC       )) ?  6 : \
	((gpio == PE04) && (func == TSC_G7_IO3_FUNC          )) ?  9 : \
	((gpio == PE04) && (func == DCMI_D4_FUNC             )) ? 10 : \
	((gpio == PE04) && (func == FMC_A20_FUNC             )) ? 12 : \
	((gpio == PE04) && (func == SAI1_FS_A_FUNC           )) ? 13 : \
	((gpio == PE04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE05) && (func == SYS_TRACED2_FUNC         )) ?  0 : \
	((gpio == PE05) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PE05) && (func == DFSDM1_CKIN3_FUNC        )) ?  6 : \
	((gpio == PE05) && (func == TSC_G7_IO4_FUNC          )) ?  9 : \
	((gpio == PE05) && (func == DCMI_D6_FUNC             )) ? 10 : \
	((gpio == PE05) && (func == FMC_A21_FUNC             )) ? 12 : \
	((gpio == PE05) && (func == SAI1_SCK_A_FUNC          )) ? 13 : \
	((gpio == PE05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE06) && (func == SYS_TRACED3_FUNC         )) ?  0 : \
	((gpio == PE06) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PE06) && (func == DCMI_D7_FUNC             )) ? 10 : \
	((gpio == PE06) && (func == FMC_A22_FUNC             )) ? 12 : \
	((gpio == PE06) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PE06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE07) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PE07) && (func == DFSDM1_DATIN2_FUNC       )) ?  6 : \
	((gpio == PE07) && (func == FMC_D4_FUNC              )) ? 12 : \
	((gpio == PE07) && (func == FMC_DA4_FUNC             )) ? 12 : \
	((gpio == PE07) && (func == SAI1_SD_B_FUNC           )) ? 13 : \
	((gpio == PE07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE08) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PE08) && (func == DFSDM1_CKIN2_FUNC        )) ?  6 : \
	((gpio == PE08) && (func == FMC_D5_FUNC              )) ? 12 : \
	((gpio == PE08) && (func == FMC_DA5_FUNC             )) ? 12 : \
	((gpio == PE08) && (func == SAI1_SCK_B_FUNC          )) ? 13 : \
	((gpio == PE08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE09) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PE09) && (func == DFSDM1_CKOUT_FUNC        )) ?  6 : \
	((gpio == PE09) && (func == FMC_D6_FUNC              )) ? 12 : \
	((gpio == PE09) && (func == FMC_DA6_FUNC             )) ? 12 : \
	((gpio == PE09) && (func == SAI1_FS_B_FUNC           )) ? 13 : \
	((gpio == PE09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE10) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PE10) && (func == DFSDM1_DATIN4_FUNC       )) ?  6 : \
	((gpio == PE10) && (func == TSC_G5_IO1_FUNC          )) ?  9 : \
	((gpio == PE10) && (func == QUADSPI_CLK_FUNC         )) ? 10 : \
	((gpio == PE10) && (func == FMC_D7_FUNC              )) ? 12 : \
	((gpio == PE10) && (func == FMC_DA7_FUNC             )) ? 12 : \
	((gpio == PE10) && (func == SAI1_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PE10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE11) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PE11) && (func == DFSDM1_CKIN4_FUNC        )) ?  6 : \
	((gpio == PE11) && (func == TSC_G5_IO2_FUNC          )) ?  9 : \
	((gpio == PE11) && (func == QUADSPI_BK1_NCS_FUNC     )) ? 10 : \
	((gpio == PE11) && (func == FMC_D8_FUNC              )) ? 12 : \
	((gpio == PE11) && (func == FMC_DA8_FUNC             )) ? 12 : \
	((gpio == PE11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE12) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PE12) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PE12) && (func == DFSDM1_DATIN5_FUNC       )) ?  6 : \
	((gpio == PE12) && (func == TSC_G5_IO3_FUNC          )) ?  9 : \
	((gpio == PE12) && (func == QUADSPI_BK1_IO0_FUNC     )) ? 10 : \
	((gpio == PE12) && (func == FMC_D9_FUNC              )) ? 12 : \
	((gpio == PE12) && (func == FMC_DA9_FUNC             )) ? 12 : \
	((gpio == PE12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE13) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PE13) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PE13) && (func == DFSDM1_CKIN5_FUNC        )) ?  6 : \
	((gpio == PE13) && (func == TSC_G5_IO4_FUNC          )) ?  9 : \
	((gpio == PE13) && (func == QUADSPI_BK1_IO1_FUNC     )) ? 10 : \
	((gpio == PE13) && (func == FMC_D10_FUNC             )) ? 12 : \
	((gpio == PE13) && (func == FMC_DA10_FUNC            )) ? 12 : \
	((gpio == PE13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE14) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PE14) && (func == TIM1_BKIN2_FUNC          )) ?  2 : \
	((gpio == PE14) && (func == TIM1_BKIN2_COMP2_FUNC    )) ?  3 : \
	((gpio == PE14) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PE14) && (func == QUADSPI_BK1_IO2_FUNC     )) ? 10 : \
	((gpio == PE14) && (func == FMC_D11_FUNC             )) ? 12 : \
	((gpio == PE14) && (func == FMC_DA11_FUNC            )) ? 12 : \
	((gpio == PE14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE15) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PE15) && (func == TIM1_BKIN_COMP1_FUNC     )) ?  3 : \
	((gpio == PE15) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PE15) && (func == QUADSPI_BK1_IO3_FUNC     )) ? 10 : \
	((gpio == PE15) && (func == FMC_D12_FUNC             )) ? 12 : \
	((gpio == PE15) && (func == FMC_DA12_FUNC            )) ? 12 : \
	((gpio == PE15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF00) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PF00) && (func == FMC_A0_FUNC              )) ? 12 : \
	((gpio == PF00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF01) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PF01) && (func == FMC_A1_FUNC              )) ? 12 : \
	((gpio == PF01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF02) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PF02) && (func == FMC_A2_FUNC              )) ? 12 : \
	((gpio == PF02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF03) && (func == FMC_A3_FUNC              )) ? 12 : \
	((gpio == PF03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF04) && (func == FMC_A4_FUNC              )) ? 12 : \
	((gpio == PF04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF05) && (func == FMC_A5_FUNC              )) ? 12 : \
	((gpio == PF05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF06) && (func == TIM5_ETR_FUNC            )) ?  1 : \
	((gpio == PF06) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PF06) && (func == QUADSPI_BK1_IO3_FUNC     )) ? 10 : \
	((gpio == PF06) && (func == SAI1_SD_B_FUNC           )) ? 13 : \
	((gpio == PF06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF07) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PF07) && (func == QUADSPI_BK1_IO2_FUNC     )) ? 10 : \
	((gpio == PF07) && (func == SAI1_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PF07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF08) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PF08) && (func == QUADSPI_BK1_IO0_FUNC     )) ? 10 : \
	((gpio == PF08) && (func == SAI1_SCK_B_FUNC          )) ? 13 : \
	((gpio == PF08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF09) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PF09) && (func == QUADSPI_BK1_IO1_FUNC     )) ? 10 : \
	((gpio == PF09) && (func == SAI1_FS_B_FUNC           )) ? 13 : \
	((gpio == PF09) && (func == TIM15_CH1_FUNC           )) ? 14 : \
	((gpio == PF09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF10) && (func == QUADSPI_CLK_FUNC         )) ?  3 : \
	((gpio == PF10) && (func == DCMI_D11_FUNC            )) ? 10 : \
	((gpio == PF10) && (func == TIM15_CH2_FUNC           )) ? 14 : \
	((gpio == PF10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF11) && (func == DCMI_D12_FUNC            )) ? 10 : \
	((gpio == PF11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF12) && (func == FMC_A6_FUNC              )) ? 12 : \
	((gpio == PF12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF13) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PF13) && (func == DFSDM1_DATIN6_FUNC       )) ?  6 : \
	((gpio == PF13) && (func == FMC_A7_FUNC              )) ? 12 : \
	((gpio == PF13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF14) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PF14) && (func == DFSDM1_CKIN6_FUNC        )) ?  6 : \
	((gpio == PF14) && (func == TSC_G8_IO1_FUNC          )) ?  9 : \
	((gpio == PF14) && (func == FMC_A8_FUNC              )) ? 12 : \
	((gpio == PF14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF15) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PF15) && (func == TSC_G8_IO2_FUNC          )) ?  9 : \
	((gpio == PF15) && (func == FMC_A9_FUNC              )) ? 12 : \
	((gpio == PF15) && (func == EVENTOUT_FUNC            )) ? 15 : \
